### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # cloudflare_access_application.test_network will be created
+   resource "cloudflare_access_application" "test_network" {
+       account_id                 = (known after apply)
+       app_launcher_visible       = true
+       aud                        = (known after apply)
+       auto_redirect_to_identity  = false
+       domain                     = (sensitive)
+       enable_binding_cookie      = false
+       http_only_cookie_attribute = true
+       id                         = (known after apply)
+       name                       = "Test Network"
+       service_auth_401_redirect  = false
+       session_duration           = "24h"
+       skip_interstitial          = false
+       type                       = "self_hosted"
+       zone_id                    = (sensitive)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>